<template>
	<view class="box">
		<view v-if="type=='xieyi'">
			<text class="text">网赚游戏服务条款</text>
			<text class="text">加入和使用网赚游戏表明您已经阅读并同意本使用条款，您的会员活动会遵从本使用条款。鉴于网赚游戏并非是关乎国计民生或者垄断的行业及企业，因此您对本使用协议不认同的，完全可以选择不加入和使用网赚游戏。</text>
			<text class="text">本协议由您与北京寰宇联动科技有限公司共同缔结，具有合同效力。</text>
			<text class="text">本协议中协议双方合称协议方</text>
			<text class="text">一、协议内容及签署</text>
			<text class="text">1、本协议内容包括协议正文及所有网赚游戏已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何网赚游戏及其关联公司提供的服务均受本协议约束。但法律法规另有强制性规定的，依其规定。</text>
			<text class="text">
				2、您在注册网赚游戏账户时点击提交“我已阅读并且同意网赚游戏的使用协议”即视为您接受本协议及各类规则，并同意受其约束。您应当在使用网赚游戏服务之前认真阅读全部协议内容并确保完全理解协议内容，如您对协议有任何疑问的，应向网赚游戏咨询。但无论您事实上是否在使用网赚游戏服务之前认真阅读了本协议内容，只要您注册、正在或者继续使用网赚游戏服务，则视为接受本协议。
			</text>
			<text class="text">
				3、您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用网赚游戏服务。
			</text>
			<text class="text">
				二、账户管理
			</text>
			<text class="text">
				1、申请资格
			</text>
			<text class="text">
				您应当是具备完全民事权利能力和完全民事行为能力的自然人。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且网赚游戏有权注销（永久冻结）您的网赚游戏账户，并向您及您的监护人索偿或者追偿。若您不具备前述主体资格，则需要监护人同意您方可注册成为网赚游戏会员，否则您和您的监护人应承担因此而导致的一切后果，且网赚游戏有权注销（永久冻结）您的网赚游戏账户，并向您及您的监护人索偿或者追偿。
			</text>
			<text class="text">
				网赚游戏并无能力对您的民事权利能力和民事行为能力进行实质性审查，因此一旦您进行了注册，网赚游戏可以视为您具备完全民事权利能力和完全民事行为能力。
			</text>
			<text class="text">
				2、账户
			</text>
			<text class="text">
				在您签署本协议，完成会员注册程序或以其他网赚游戏允许的方式实际使用网赚游戏服务时，网赚游戏会向您提供唯一编号的网赚游戏账户ID（以下亦称账户）。
			</text>
			<text class="text">
				您应当妥善保护您的账户安全，您应对您的账户和密码的安全，以及对通过您的账户实施的行为负责。除非经过正当法律程序，且征得网赚游戏的同意，否则，账户和密码不得以任何方式转让、赠与或继承。如果发现任何人可能危及您的账户安全的情形时，您应当立即以有效方式通知网赚游戏，要求网赚游戏暂停该账户相关服务。您理解网赚游戏对您的请求采取行动需要合理时间，网赚游戏对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任，但网赚游戏未能在合理时间内采取行动的情况除外。您认可您在注册、使用网赚游戏服务过程中提供、形成的数据等相关信息的所有权及其他相关权利属于网赚游戏，网赚游戏有权使用上述信息。
			</text>
			<text class="text">
				三、网赚游戏服务使用规范及处理规定
			</text>
			<text class="text">
				在使用网赚游戏服务过程中，您承诺遵守下列使用规范：
			</text>
			<text class="text">
				1、会员承诺其注册信息的正确性。
			</text>
			<text class="text">
				2、如果会员提供给网赚游戏的资料有变更，请及时通知网赚游戏做出相应的修改。
			</text>
			<text class="text">
				3、会员不得出现恶意注册恶意点击恶意虚假消费等行为。
			</text>
			<text class="text">
				4、在使用网赚游戏服务过程中实施的所有行为均遵守国家法律、法规等规范性文件及网赚游戏各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己独自承担所有的法律责任，并确保网赚游戏免于因此产生任何损失。如网赚游戏因此承担相应责任或者赔偿相关损失，则您承诺网赚游戏可以向您追偿，相关责任或损失由您最终承担。
			</text>
			<text class="text">
				5、在网赚游戏平台消费过程中，遵守诚实信用原则，不采取不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。
			</text>
			<text class="text">
				6、不对网赚游戏平台上的任何数据作商业性利用，包括但不限于在未经网赚游戏事先书面同意的情况下，以复制、传播等任何方式使用网赚游戏站上展示的资料。
			</text>
			<text class="text">
				7、网赚游戏严禁各种针对网赚游戏活动的作弊行为。对于查实的作弊行为，我们有权收回该账号及其关联账号全部的邀请奖励、取消邀请资格，并列入网赚游戏黑名单账户。作弊行为包括但不限于：使用相同的电脑或设备，相同的IP地址在同一天内注册多个账号，以骗取邀请奖励的行为。
			</text>
			<text class="text">
				8、网赚游戏禁止会员在网赚游戏内进行任何形式的推广。
			</text>
			<text class="text">
				9、您不得使用任何装置、软件或例行程序干预或试图干预网赚游戏平台的正常运作或正在网赚游戏上进行的任何交易、活动。您不得采取任何将导致不合理的庞大数据负载加诸网赚游戏网络设备的行动，否则网赚游戏将追究您的相关责任，包括但不限于取消相关邀请奖励、取消邀请资格、列入网赚游戏黑名单账户、冻结账户或者注销账户等。如造成网赚游戏损失或者承担相应法律责任的，网赚游戏有权要求您赔偿并最终承担相应的责任。
			</text>
			<text class="text">
				您了解并同意网赚游戏有权作如下处理：
			</text>
			<text class="text">
				1、网赚游戏有权对您是否违反上述承诺做出单方认定，并根据单方认定结果适用规则予以处理，这无须征得您的同意。
			</text>
			<text class="text">
				2、经国家行政或司法机关的生效法律文书确认您存在违法或侵权行为，或者网赚游戏根据自身的判断，认为您的行为涉嫌违反本协议或规则的条款或涉嫌违反法律法规的规定的，则网赚游戏有权在网赚游戏上公示您的该等涉嫌违法或违约行为及网赚游戏已对您采取的措施。
			</text>
			<text class="text">
				3、对于您在网赚游戏上发布的涉嫌违法或涉嫌侵犯他人合法权利或违反本协议或规则的信息，网赚游戏有权予以删除，且按照规则的规定进行处罚。
			</text>
			<text class="text">
				4、对于您在网赚游戏上实施的行为，包括您未在网赚游戏上实施但已经对网赚游戏及其用户产生影响的行为，网赚游戏有权单方认定您行为的性质及是否构成对本协议或规则的违反，并据此作出相应处罚。您应自行保存与您行为有关的全部证据，并应对无法提供充要证据而承担的不利后果。
			</text>
			<text class="text">
				5、对于您涉嫌违反承诺的行为对任意第三方造成损害的，您均应当以自己的名义独立承担所有的法律责任，并应确保网赚游戏免于因此产生损失或增加费用。如网赚游戏因此承担相应责任或者赔偿相关损失，则您承诺网赚游戏可以向您追偿，相关责任或损失由您最终承担，相关损失包括合理的律师费用、相关机构的查询费用等。
			</text>
			<text class="text">
				6、如您涉嫌违反有关法律或者本协议之规定，使网赚游戏遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，您应当赔偿网赚游戏因此造成的损失及发生的费用，包括合理的律师费用、相关机构的查询费用等。
			</text>
			<text class="text">
				7、网赚游戏以上展示的资料（包括但不限于文字、图表、标识、图像、数字下载和数据编辑）均为网赚游戏或其内容提供者的财产或者权利；网赚游戏上所有内容的汇编是属于网赚游戏的著作权；网赚游戏上所有软件都是网赚游戏或其关联公司或其软件供应商的财产或者权利，上述知识产权均受法律保护。如您侵犯上述权利，网赚游戏有权根据规则对您进行处理并追究您的法律责任。
			</text>
			<text class="text">
				8、网赚游戏并无能力对您的相关注册进行实质性审查，因此一旦因您的注册的问题导致的相关后果应全部由您自己承担，网赚游戏对此不承担责任。如果根据法律法规要求网赚游戏先行承担了相关责任，那么您承诺网赚游戏有权向您追偿，由您最终承担上述责任。
			</text>
			<text class="text">
				四、特别授权
			</text>
			<text class="text">
				您完全理解并不可撤销地授予网赚游戏及其关联公司下列权利：
			</text>
			<text class="text">
				1、一旦您向网赚游戏或其关联公司或其合作组织作出任何形式的承诺，且相关公司或组织已确认您违反了该承诺，则网赚游戏有权立即按您的承诺或协议约定的方式对您的账户采取限制措施，包括中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，除非法律法规另有明确要求，网赚游戏无须就相关确认与您核对事实，或另行征得您的同意，且网赚游戏无须就此限制措施或公示行为向您承担任何的责任。
			</text>
			<text class="text">
				2、一旦您违反本协议，或与网赚游戏签订的其他协议的约定，网赚游戏有权以任何方式通知网赚游戏关联公司或其合作组织，要求其对您的权益采取限制措施，包括但不限于要求网赚游戏将您账户内的资产数清零，要求关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。
			</text>
			<text class="text">
				3、对于您在注册或者交易中记录的资料及数据信息，您授予网赚游戏及其关联公司或其合作组织独家的、永久的、免费的全球范围内使用并许可他人使用的权利。
			</text>
			<text class="text">
				4、网赚游戏及其关联公司有权受理您与其他会员因交易产生的争议，并有权单方判断与该争议相关的事实及应适用的规则，进而作出处理决定。该处理决定对您有约束力。如该争议造成网赚游戏及其关联公司损失的，您应及时弥补网赚游戏及其关联公司的损失，否则网赚游戏及其关联公司有权直接抵减您在合同项下和账户中的权益，并有权继续追偿。
			</text>
			<text class="text">
				五、责任范围和责任限制
			</text>
			<text class="text">
				1、网赚游戏负责按"现状"和"可得到"的状态向您提供服务，且网赚游戏仅对自身提供的服务承担责任。网赚游戏对于第三方向会员提供的服务和产品不提供保证也不承担任何责任，但应当协助会员和第三方进行交涉谈判以维护会员合法权益。
			</text>
			<text class="text">
				2、您了解网赚游戏上的大量信息系第三方平台自行发布，且可能存在风险和瑕疵。网赚游戏仅作为交易平台。网赚游戏仅作为您获取物品或服务信息、物色交易对象、就物品或服务的交易进行协商及开展交易的场所，但网赚游戏无法控制交易所涉及的物品的质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在贸易协议中各项义务的能力。您应自行谨慎判断确定相关物品及信息的真实性、合法性和有效性，并自行承担相关风险。
			</text>
			<text class="text">
				3、网赚游戏上的商品价格、数量、是否有货等商品信息随时有可能发生变动，网赚游戏不就此作出特别通知。您知悉并理解由于网站上商品信息数量极其庞大，虽然网赚游戏会尽合理的最大努力保证您所浏览的商品信息的准确性、迅捷性，但由于众所周知的互联网技术因素等客观原因，网赚游戏显示的信息可能存在一定的滞后性和差错，由此给您带来的不便或产生相应问题，网赚游戏不承担责任。
			</text>
			<text class="text">
				4、除非法律法规明确要求，或出现以下情况，否则，网赚游戏没有义务对所有用户的注册数据、商品（服务）信息、交易行为以及与交易有关的其它事项进行事先审查：
			</text>
			<text class="text">
				a)网赚游戏有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形。
			</text>
			<text class="text">
				b)网赚游戏有合理的理由认为用户在网赚游戏的行为涉嫌违法或不当。
			</text>
			<text class="text">
				5、您理解并同意，网赚游戏及其关联公司并非司法机构，仅能以普通人的身份对证据进行鉴别，网赚游戏及其关联公司对争议的调处完全是基于您的委托，网赚游戏及其关联公司无法保证争议处理结果符合您的期望，也不对争议调处结论承担任何责任。如您因此遭受损失，您同意自行通过法律途径向受益人或者其他相关人员索偿。
			</text>
			<text class="text">
				6、您了解并同意，网赚游戏不对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿 (无论网赚游戏是否已被告知该等损害赔偿的可能性)：
			</text>
			<text class="text">
				a)第三方未经批准的使用您的账户或更改您的数据。
			</text>
			<text class="text">
				b)通过网赚游戏服务购买或获取任何商品、样品、数据、信息或进行交易等行为或替代行为产生的费用及损失，但因网赚游戏提供的服务信息错误所导致的除外。
			</text>
			<text class="text">
				c)您对网赚游戏服务的误解。
			</text>
			<text class="text">
				d)任何非因网赚游戏的原因而引起的与网赚游戏服务有关的其它损失。
			</text>
			<text class="text">
				7、因使用网赚游戏服务而引起的任何损害或经济损失，网赚游戏承担的全部责任均不超过您通过网赚游戏所购买的或与该索赔有关的服务或商品的价格。本责任限制条款在会员资格被冻结、暂停或注销后仍继续有效。
			</text>
			<text class="text">
				8、不论在何种情况下，网赚游戏均不对由于罢工、暴乱、起义、骚乱、火灾、洪水、风暴、爆炸、战争、政府行为、司法行政机关的命令，以及其它非因网赚游戏的原因而造成的不能服务或延迟服务承担责任。网赚游戏会尽合理努力处理善后事宜。
			</text>
			<text class="text">
				六、协议终止
			</text>
			<text class="text">
				1、您同意，网赚游戏有权依据本协议决定中止、终止向您提供部分或全部网赚游戏平台服务，暂时冻结或永久冻结（注销）您的账户，且无须为此向您或任何第三方承担任何责任，但本协议或法律法规另有明确要求的除外。
			</text>
			<text class="text">
				2、出现以下情况时，网赚游戏有权直接以注销账户的方式终止本协议：
			</text>
			<text class="text">
				a)网赚游戏终止向您提供服务后，您涉嫌再一次直接或间接或以他人名义注册为网赚游戏用户的；
			</text>
			<text class="text">
				b)本协议（含规则）变更时，您明示并通知网赚游戏不愿接受新的服务协议的；
			</text>
			<text class="text">
				c)其它网赚游戏认为应当终止服务的情况。
			</text>
			<text class="text">
				3、您有权向网赚游戏要求注销您的账户，经网赚游戏审核同意的，网赚游戏注销（永久冻结）您的账户，届时，您与网赚游戏基于本协议的合同关系即终止。您的账户被注销（永久冻结）后，网赚游戏没有义务为您保留或向您披露您账户中的任何信息，也没有义务向您或第三方转发任何您未曾阅读或发送过的信息。
			</text>
			<text class="text">
				4、您同意，您与网赚游戏的合同关系终止后，网赚游戏及其关联公司或者其合作组织仍享有下列权利：
			</text>
			<text class="text">
				a)继续保存并使用您的注册、数据及您使用网赚游戏服务期间的所有交易数据。
			</text>
			<text class="text">
				b)您在使用网赚游戏服务期间存在违法行为或违反本协议或规则的行为的，网赚游戏仍可依据本协议向您主张权利。
			</text>
			<text class="text">
				5、网赚游戏中止或终止向您提供服务后，对于您在服务中止或终止之前的交易行为依下列原则处理，您应独力处理并完全承担进行以下处理所产生的任何争议、损失或增加的任何费用，并应确保网赚游戏免于因此产生任何损失或承担任何费用：
			</text>
			<text class="text">
				a)您在服务中止或终止之前已经上传至网赚游戏的未完成的交易或活动信息，网赚游戏有权在中止或终止服务的同时删除此项内容的相关信息；
			</text>
			<text class="text">
				b)您在服务中止或终止之前已经与其他会员达成买卖合同，但合同尚未实际履行的，网赚游戏有权删除该买卖合同及其交易物品在网赚游戏平台上的相关信息；
			</text>
			<text class="text">
				c)您在服务中止或终止之前已经与其他会员达成买卖合同且已部分履行的，网赚游戏可以不删除该项交易，但网赚游戏有权在中止或终止服务的同时将相关情形通知您的交易对方。
			</text>
			<text class="text">
				七、隐私权政策
			</text>
			<text class="text">
				1、网赚游戏对希望成为会员的用户没有任何限制，但18岁以下的用户使用网赚游戏服务必须取得监护人的同意；
			</text>
			<text class="text">
				2、一个帐号仅限一个会员使用，会员必须向网赚游戏提供真实确实的信息，由于资料提供不正确导致提现无法收到等后果，网赚游戏不承担责任；
			</text>
			<text class="text">
				3、会员资料修改后必须及时通知网赚游戏做出相应变更；
			</text>
			<text class="text">
				4、网赚游戏及其关联公司承诺不向其它第三方机构透露会员涉及隐私的信息；
			</text>
			<text class="text">
				八、法律适用、管辖与其他
			</text>
			<text class="text">
				1、本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和行业惯例。
			</text>
			<text class="text">
				2、因本协议产生之争议，应依照中华人民共和国法律予以处理。双方对于争议协商不成的，应当提交北京寰宇联动科技有限公司所在地人民法院诉讼解决。
			</text>
		</view>

		<view v-else>
			<text class="text">
				网赚游戏隐私协议
			</text>
			<text class="text">
				用户隐私的保护
			</text>
			<text class="text">
				网赚游戏对于会员提供的、自行收集的、经认证的个人信息将按照本协议予以保护、使用。会员同意网赚游戏可以因业务合作向网赚游戏关联实体转让与网赚游戏平台有关的全部或部分权利和义务。未经网赚游戏事先书面同意，会员不得转让其在本协议项下的任何权利和义务。
			</text>
			<text class="text">
				网赚游戏按照会员在网赚游戏平台上的行为自动追踪关于会员的某些资料。在不透露会员的隐私资料的前提下，网赚游戏有权对整个会员数据库进行分析并对会员数据库进行商业上的利用。
			</text>
			<text class="text">
				会员允许网赚游戏可使用关于会员的相关资料（包括但不限于网赚游戏持有的有关会员的档案中的资料，网赚游戏从会员目前及以前在网赚游戏平台上的活动所获取的其他资料以及网赚游戏通过其他方式自行收集的资料）来解决争议、对纠纷进行调停以及配合权利受损害会员走报案、立案等法律程序。会员同意网赚游戏可通过人工或自动程序对会员的资料进行评价。
			</text>
			<text class="text">
				网赚游戏采用行业标准惯例来保护会员的资料。会员因履行本协议提供给网赚游戏的信息，网赚游戏不会恶意出售或免费共享给任何第三方，以下情况除外：
			</text>
			<text class="text">
				1、提供独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等；
			</text>
			<text class="text">
				2、具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构，如公安机关、法院；
			</text>
			<text class="text">
				3、网赚游戏的关联实体；
			</text>
			<text class="text">
				4、经平台使用方或平台使用方授权代表同意的第三方。
			</text>
			<text class="text">
				网赚游戏有义务根据有关法律要求向司法机关和政府部门提供您的个人资料。如果会员严重违反网赚游戏的相关规则，网赚游戏有权对会员提供的个人信息编辑入黑名单，拒绝相关会员使用网赚游戏及网赚游戏相关的任何平台服务。由此可能造成的您的任何损失，由相关会员自行承担。
			</text>
			<text class="text">
				网赚游戏建立有用户隐私权投诉处理机制，接受与用户个人信息保护有关的投诉，并自接到投诉之日起十五日内答复投诉人。投诉方式为APP客服。
			</text>
			<text class="text">
				知识产权的保护
			</text>
			<text class="text">
				网赚游戏平台上所有内容，包括著作、图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计，均由网赚游戏或其他权利人依法拥有其知识产权，包括商标权、专利权、著作权、商业秘密等。
			</text>
			<text class="text">
				非经网赚游戏书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行网赚游戏平台程序或内容。
			</text>
			<text class="text">
				会员未经网赚游戏的明确书面同意不许下载（除了页面缓存）、修改平台。会员不得对网赚游戏平台进行转售或商业利用；不得收集产品目录、说明和价格；不得对网赚游戏平台进行任何衍生利用；不得为其他商业利益而下载、拷贝账户信息、使用任何数据采集、Robots或类似的数据收集和摘录工具。未经网赚游戏的书面许可，严禁对网赚游戏平台的内容进行系统获取以直接或间接创建或编辑文集、汇编、数据库或人名地址录（无论是否通过
				Robots、Spiders、自动仪器或手工操作）。另外，严禁为任何未经本使用条件明确允许的目的而使用网赚游戏平台上的内容和材料。
			</text>
			<text class="text">
				未经网赚游戏明确书面同意，不得以任何商业目的对网赚游戏网站或其任何部分进行复制、复印、仿造、出售、转售、访问、或以其他方式加以利用。未经网赚游戏明确书面同意，会员不得用frame或运用frame技巧把网赚游戏或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）据为己有。未经网赚游戏明确书面同意，会员不得以Meta
				Tags或任何其他"隐藏文本"方式使用网赚游戏或其关联公司的名字和商标。任何未经授权的使用都会终止网赚游戏所授予的允许或许可。
			</text>
			<text class="text">
				尊重知识产权是会员应尽的义务，如有违反，会员应对网赚游戏承担损害赔偿等法律责任。
			</text>
		</view>
	</view>
</template>

<script>
	export {
		default
	}
	from "./xieyi.js";
</script>

<style>
	@import url("./xieyi.css");
</style>
